import torch

device = torch.device("cuda:0" if torch.cuda.is_available() else "cpu")
cuda_ids = [0, 1, 2, 3]

################################################################################
# Dialog status
################################################################################
FAILED_DIALOG = -1
SUCCESS_DIALOG = 1
NO_OUTCOME_YET = 0

################################################################################
#  Slot Values
################################################################################
TRUE = 1  # 有该症状
FALSE = -1  # 无该症状
NOT_SURE = 0.6  # 不确定是否有
NOT_MENTION = 0.3  # 未提问
PADDING = 0.4 # 为了批处理 对症状进行填充
